## Chinook Database

The Chinook database contains information about a fictional digital music shop - kind of like a mini-iTunes store.

* contains information about the artists, songs, and albums from the music shop, as well as information on the shop's employees, customers, and the customers purchases. 
* This information is contained in eleven tables.

In [1]:
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect("chinook.db")

**3 tables in DB to be joined**

In [16]:
#Visualizing a few tables in the database
invoice_line = "SELECT * FROM invoice_line"
track = "SELECT * FROM track"
media_type = "SELECT * FROM media_type"

In [12]:
print("invoice_line table")
pd.read_sql_query(invoice_line, conn).head()

invoice_line table

   invoice_line_id  invoice_id  track_id  unit_price  quantity
0                1           1      1158        0.99         1
1                2           1      1159        0.99         1
2                3           1      1160        0.99         1
3                4           1      1161        0.99         1
4                5           1      1162        0.99         1

In [14]:
print("track table")
pd.read_sql_query(track, conn).head()

track table

,track_id,name,album_id,media_type_id,genre_id,composer,milliseconds,bytes,unit_price
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [15]:
print("media_type table")
pd.read_sql_query(media_type, conn).head()

media_type table

   media_type_id                         name
0              1              MPEG audio file
1              2     Protected AAC audio file
2              3  Protected MPEG-4 video file
3              4     Purchased AAC audio file
4              5               AAC audio file

## Invoce_id = 4 

Table contains:
* id from **track_id**
* name of the track, **track_name**
* Name of media type of the track, **track_type**
* Price paid by customer for the track, **unit_price**
* Quantity of the track purchased, **quantity**